<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"a58310963254d7267cf13dcfa1a81d13d0e6e7f900488d5394371a33552db992","plan_job_ref":"Job Create MPE Management terraform plan #88 at https://github.com/AFMPE/mpe_management/actions/runs/4846929773","plan_hash":"62e9a5f9e21ebd01c349e395283912284cf2bd804ad7786466de4e7573edfbf6","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 2 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Added_To_Local_Admins"] will be destroyed
  # (because key ["User_Added_To_Local_Admins"] is not in for_each map)
  - resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
      - custom_details             = {} -> null
      - display_name               = "User added to local admins using net.exe" -> null
      - enabled                    = true -> null
      - id                         = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-ops-logging-core-prod-rg/providers/Microsoft.OperationalInsights/workspaces/ampe-eus-ops-logging-core-prod-log/providers/Microsoft.SecurityInsights/alertRules/User_Added_To_Local_Admins" -> null
      - log_analytics_workspace_id = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-ops-logging-core-prod-rg/providers/Microsoft.OperationalInsights/workspaces/ampe-eus-ops-logging-core-prod-log" -> null
      - name                       = "User_Added_To_Local_Admins" -> null
      - query                      = <<-EOT
            // Query for local admins being added using "net user" command
            // In this example we look for use possible uses of uncommon commandline options (/ad instead of /add)
            DeviceProcessEvents
            // To find executions of a known filename, it is better to filter on the filename (and possibly on folder path).
            | where FileName in~ ("net.exe", "net1.exe") and TimeGenerated > ago(1h)
            | where ProcessCommandLine has "localgroup administrators"
            | where ProcessCommandLine contains "/ad"
            | where not (FileName =~ "net1.exe" and InitiatingProcessFileName =~ "net.exe" and replace("net", "net1", InitiatingProcessCommandLine) =~ ProcessCommandLine)
            | where not(InitiatingProcessCommandLine has_any ("Scripts\\Startup\\Add_Admin.bat", "KACE"))
        EOT -> null
      - query_frequency            = "PT1H" -> null
      - query_period               = "PT1H" -> null
      - severity                   = "Medium" -> null
      - suppression_duration       = "PT5H" -> null
      - suppression_enabled        = false -> null
      - tactics                    = [
          - "Persistence",
        ] -> null
      - techniques                 = [
          - "T1078",
        ] -> null
      - trigger_operator           = "GreaterThan" -> null
      - trigger_threshold          = 0 -> null

      - entity_mapping {
          - entity_type = "Host" -> null

          - field_mapping {
              - column_name = "DeviceName" -> null
              - identifier  = "HostName" -> null
            }
        }

      - event_grouping {
          - aggregation_method = "SingleAlert" -> null
        }

      - incident_configuration {
          - create_incident = true -> null

          - grouping {
              - enabled                 = true -> null
              - entity_matching_method  = "AllEntities" -> null
              - group_by_alert_details  = [
                  - "Severity",
                ] -> null
              - group_by_custom_details = [] -> null
              - group_by_entities       = [] -> null
              - lookback_duration       = "PT5H" -> null
              - reopen_closed_incidents = false -> null
            }
        }
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #88](https://github.com/AFMPE/mpe_management/actions/runs/4846929773)